Revit 2024 API
BuiltInFailures.ElectricalFailures.MismatchConnectorDistSysToCircuit Property
 Cannot add [Element] to Circuit. The Type for the available connector does not match the Type ([Name]) for the Circuit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId MismatchConnectorDistSysToCircuit { get; }
Visual Basic
Public Shared ReadOnly Property MismatchConnectorDistSysToCircuit As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ MismatchConnectorDistSysToCircuit {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace